nxvpro/Resources/soap_replay.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<GetReplayUri xmlns="http://www.onvif.org/ver10/replay/wsdl">
			<StreamSetup>
				<Stream xmlns="http://www.onvif.org/ver10/schema">RTP-Unicast</Stream>
				<Transport
					xmlns="http://www.onvif.org/ver10/schema">
					<Protocol>RTSP</Protocol>
				</Transport>
			</StreamSetup>
			<RecordingToken>_REC_TOKEN_</RecordingToken>
		</GetReplayUri>
	</s:Body>
</s:Envelope>
