Version2/TestTool/TestTool.Setup/Requests/Replay/GetReplayConfiguration/GetReplayConfiguration.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trp1="http://www.onvif.org/ver10/replay/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trp1:GetReplayConfiguration />
  </soap:Body>
</soap:Envelope>