Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/Replay/GetReplayUri/GetStreamUri (Short).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trp1="http://www.onvif.org/ver10/replay/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trp1:GetReplayUri>
      <trp1:StreamSetup>
        <trp1:Stream>RTP-Unicast</trp1:Stream>
        <trp1:Transport>
          <trp1:Protocol>UDP</trp1:Protocol>
        </trp1:Transport>
      </trp1:StreamSetup>
      <trp1:RecordingToken>tokenRecording1</trp1:RecordingToken>
    </trp1:GetReplayUri>
  </soap:Body>
</soap:Envelope>